In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [3]:
df = pd.read_csv('./Apart_Deal.csv')

In [4]:
df.head()

    지역코드  법정동             거래일       아파트     지번      전용면적   층  건축년도   거래금액
0  31110  학성동  5/30/2020 0:00    남운학성타운    379  135.5800   8  1991  26700
1  31110  남외동   1/3/2020 0:00  남외푸르지오1차  506-1  101.6000   2  2006  35500
2  31110  남외동   1/3/2020 0:00     에일린의뜰    500   84.9920  11  2007  36500
3  31110  남외동   1/3/2020 0:00  남외푸르지오1차  506-1  118.7060   8  2006  43000
4  31110  남외동   1/4/2020 0:00  남외푸르지오2차  501-1   84.9636   7  2007  38700

In [5]:
df.columns = ['code', 'dong', 'date', 'apart_name','region_num', 'square', 'floor', 'blit_year', 'cost']

In [6]:
df.head(10)

,code,dong,date,apart_name,region_num,square,floor,blit_year,cost
0,31110,학성동,5/30/2020 0:00,남운학성타운,379,135.5800,8,1991,26700
1,31110,남외동,1/3/2020 0:00,남외푸르지오1차,506-1,101.6000,2,2006,35500
2,31110,남외동,1/3/2020 0:00,에일린의뜰,500,84.9920,11,2007,36500
3,31110,남외동,1/3/2020 0:00,남외푸르지오1차,506-1,118.7060,8,2006,43000
4,31110,남외동,1/4/2020 0:00,남외푸르지오2차,501-1,84.9636,7,2007,38700
5,31110,남외동,1/7/2020 0:00,에일린의뜰,500,114.7345,2,2007,41000
6,31110,남외동,1/8/2020 0:00,에일린의뜰,500,84.9920,5,2007,34000
7,31110,남외동,1/9/2020 0:00,백합,447-5,65.7200,5,1985,8000
8,31110,남외동,1/11/2020 0:00,에일린의뜰,500,114.7345,10,2007,44300
9,31110,남외동,1/18/2020 0:00,남외푸르지오1차,506-1,84.7820,9,2006,36000

In [7]:
df.dong[df['dong'] == '학성동']

0          학성동
233        학성동
234        학성동
235        학성동
236        학성동
          ...
4301277    학성동
4301278    학성동
4301279    학성동
4301280    학성동
4301281    학성동
Name: dong, Length: 1046, dtype: object

In [8]:
dong = pd.read_csv('./dong_total.txt', sep='\t')

In [9]:
dong.head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

In [10]:
dong.columns = ['code', 'dong', 'YN']

In [11]:
dong['code'] = dong['code'].astype(str).str[:5]

In [12]:
dong['dong'] = dong['dong'].str.split(' ').str[1]

In [13]:
dong.head(5)

    code dong  YN
0  11000  NaN  존재
1  11110  종로구  존재
2  11110  종로구  존재
3  11110  종로구  존재
4  11110  종로구  존재

In [14]:
dong.dropna(axis=0, inplace = True)

In [15]:
dong.head(5)

    code dong  YN
1  11110  종로구  존재
2  11110  종로구  존재
3  11110  종로구  존재
4  11110  종로구  존재
5  11110  종로구  존재

In [15]:
# dong.to_csv('ci_gu.csv')

In [16]:
dong['code'] = dong['code'].astype(int)

In [17]:
dong.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 46269 entries, 1 to 46291
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   code    46269 non-null  int64
 1   dong    46269 non-null  object
 2   YN      46269 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.4+ MB

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4315703 entries, 0 to 4315702
Data columns (total 9 columns):
 #   Column      Dtype
---  ------      -----
 0   code        int64
 1   dong        object
 2   date        object
 3   apart_name  object
 4   region_num  object
 5   square      float64
 6   floor       object
 7   blit_year   int64
 8   cost        int64
dtypes: float64(1), int64(3), object(5)
memory usage: 296.3+ MB

In [19]:
dong.drop(['YN'],axis=1, inplace=True)

In [41]:
cu = dong.drop_duplicates()

In [49]:
cu = cu.reset_index()

In [50]:
cu.drop(['index'], axis=1, inplace=True)

In [51]:
cu

      code  dong
0    11110   종로구
1    11140    중구
2    11170   용산구
3    11200   성동구
4    11215   광진구
..     ...   ...
458  49130  서귀포시
459  49710  북제주군
460  49720  남제주군
461  50110   제주시
462  50130  서귀포시

[463 rows x 2 columns]

In [53]:
# cu.to_csv('no_dupli.csv')

In [58]:
cu['code'] == 11110

0       True
1      False
2      False
3      False
4      False
       ...
458    False
459    False
460    False
461    False
462    False
Name: code, Length: 463, dtype: bool